<?
$sityName = "Кафка";

$blockH1 = "Информация обо мне";

$year = "2018";

$site = "
<!DOCTYPE html>
<html>
<head>
	<title>{$sityName}</title>
</head>
<body>
<center><h1>{$blockH1}</h1></center>
Проснувшись однажды утром после беспокойного сна, Грегор Замза обнаружил, что он у себя в постели превратился в страшное насекомое. Лежа на панцирнотвердой спине, он видел, стоило ему приподнять голову, свой коричневый, выпуклый, разделенный дугообразными чешуйками живот, на верхушке которого еле держалось готовое вот-вот окончательно сползти одеяло.
<br><br>
Тут можете поместить картинку 
<br><br>
<a href=\"lesson1.html\"><h2>Переход к первому заданию</h2></a>
<br><br>
<h4 style=\"color:green\">Этот текст зеленый</h4>
<center>
{$year}
</center>
</body>
</html>
";

echo $site;